nxp-mcuxpresso/mcuxsdk-examples/_boards/lpcxpresso55s06/common/pin_mux/pin_mux.h
/*
 * Copyright 2024 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M33 */

#define IOCON_PIO_DIGITAL_EN 0x0100u  /*!<@brief Enables digital function */
#define IOCON_PIO_FUNC1 0x01u         /*!<@brief Selects pin function 1 */
#define IOCON_PIO_INV_DI 0x00u        /*!<@brief Input function is not inverted */
#define IOCON_PIO_MODE_INACT 0x00u    /*!<@brief No addition pin function */
#define IOCON_PIO_OPENDRAIN_DI 0x00u  /*!<@brief Open drain is disabled */
#define IOCON_PIO_SLEW_STANDARD 0x00u /*!<@brief Standard mode, output slew rate control is enabled */

/*! @name FC0_RXD_SDA_MOSI_DATA (number 61), U11[14]/U22[14]/FC0_USART_RXD
  @{ */
/* @} */

/*! @name FC0_TXD_SCL_MISO_WS (number 63), J10[18]/U11[13]/U22[13]/FC0_USART_TXD
  @{ */
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UARTPins(void); /* Function assigned for the Cortex-M33 */

#define IOCON_PIO_ASW_DI 0x00u        /*!<@brief Analog switch is open (disabled) */
#define IOCON_PIO_DIGITAL_EN 0x0100u  /*!<@brief Enables digital function */
#define IOCON_PIO_FUNC6 0x06u         /*!<@brief Selects pin function 6 */
#define IOCON_PIO_INV_DI 0x00u        /*!<@brief Input function is not inverted */
#define IOCON_PIO_MODE_INACT 0x00u    /*!<@brief No addition pin function */
#define IOCON_PIO_MODE_PULLDOWN 0x10u /*!<@brief Selects pull-down function */
#define IOCON_PIO_MODE_PULLUP 0x20u   /*!<@brief Selects pull-up function */
#define IOCON_PIO_OPENDRAIN_DI 0x00u  /*!<@brief Open drain is disabled */
#define IOCON_PIO_SLEW_STANDARD 0x00u /*!<@brief Standard mode, output slew rate control is enabled */

/*! @name SWO (number 13), J9[15]/U18[12]/N4M_SWO
  @{ */
/* @} */

/*! @name SWCLK (number 6), J9[19]/J10[8]/U18[4]/N4M_SWDCLK
  @{ */
/* @} */

/*! @name SWDIO (number 5), J9[17]/J10[6]/U18[8]/N4M_SWDIO
  @{ */
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSWD_DEBUGPins(void); /* Function assigned for the Cortex-M33 */

#define IOCON_PIO_ASW_DI 0x00u        /*!<@brief Analog switch is open (disabled) */
#define IOCON_PIO_DIGITAL_EN 0x0100u  /*!<@brief Enables digital function */
#define IOCON_PIO_FUNC0 0x00u         /*!<@brief Selects pin function 0 */
#define IOCON_PIO_INV_DI 0x00u        /*!<@brief Input function is not inverted */
#define IOCON_PIO_MODE_PULLUP 0x20u   /*!<@brief Selects pull-up function */
#define IOCON_PIO_OPENDRAIN_DI 0x00u  /*!<@brief Open drain is disabled */
#define IOCON_PIO_SLEW_STANDARD 0x00u /*!<@brief Standard mode, output slew rate control is enabled */

/*! @name PIO0_18 (number 38), J12[4]/Q4[G2]/ARD_LEDG_PWM
  @{ */
#define BOARD_INITLEDSPINS_LED_GREEN_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITLEDSPINS_LED_GREEN_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_INITLEDSPINS_LED_GREEN_PIN 18U   /*!<@brief 0U pin index: 18 */
                                               /* @} */

/*! @name PIO0_21 (number 49), J9[2]/J9[13]/J12[5]/Q5[G1]/ARD_LEDR_PWM
  @{ */
#define BOARD_INITLEDSPINS_LED_RED_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITLEDSPINS_LED_RED_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_INITLEDSPINS_LED_RED_PIN 21U   /*!<@brief 0U pin index: 21 */
                                             /* @} */

/*! @name PIO0_22 (number 51), J12[8]/Q4[G1]/ARD_LEDB_PWM
  @{ */
#define BOARD_INITLEDSPINS_LED_BLUE_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITLEDSPINS_LED_BLUE_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_INITLEDSPINS_LED_BLUE_PIN 22U   /*!<@brief 0U pin index: 22 */
                                              /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLEDsPins(void); /* Function assigned for the Cortex-M33 */

#define IOCON_PIO_ASW_DI 0x00u        /*!<@brief Analog switch is open (disabled) */
#define IOCON_PIO_DIGITAL_EN 0x0100u  /*!<@brief Enables digital function */
#define IOCON_PIO_FUNC0 0x00u         /*!<@brief Selects pin function 0 */
#define IOCON_PIO_INV_DI 0x00u        /*!<@brief Input function is not inverted */
#define IOCON_PIO_MODE_PULLUP 0x20u   /*!<@brief Selects pull-up function */
#define IOCON_PIO_OPENDRAIN_DI 0x00u  /*!<@brief Open drain is disabled */
#define IOCON_PIO_SLEW_STANDARD 0x00u /*!<@brief Standard mode, output slew rate control is enabled */

/*! @name PIO1_9 (number 3), SW3/J13[2]/ARD_BTN_USR_P1_9
  @{ */
#define BOARD_INITBUTTONSPINS_USR_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITBUTTONSPINS_USR_PORT 1U   /*!<@brief PORT device name: 1U */
#define BOARD_INITBUTTONSPINS_USR_PIN 9U    /*!<@brief 1U pin index: 9 */
                                            /* @} */

/*! @name PIO0_28 (number 44), SW1/J8[2]/J10[1]/J12[15]/MIK_EXP_BTN_WK
  @{ */
#define BOARD_INITBUTTONSPINS_WAKEUP_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITBUTTONSPINS_WAKEUP_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_INITBUTTONSPINS_WAKEUP_PIN 28U   /*!<@brief 0U pin index: 28 */
                                               /* @} */

/*! @name PIO0_5 (number 58), SW4/J9[7]/J17[7]/JS3[1]/U22[11]/U23[4]/N4M_ISP_MODE
  @{ */
#define BOARD_INITBUTTONSPINS_ISP_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITBUTTONSPINS_ISP_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_INITBUTTONSPINS_ISP_PIN 5U    /*!<@brief 0U pin index: 5 */
                                            /* @} */

/*! @name RESETN (number 23), SW2/J7[2]/J10[9]/J10[10]/U18[16]/N4M_RESET#
  @{ */
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitBUTTONsPins(void); /* Function assigned for the Cortex-M33 */

#define IOCON_PIO_DIGITAL_EN 0x0100u  /*!<@brief Enables digital function */
#define IOCON_PIO_FUNC0 0x00u         /*!<@brief Selects pin function 0 */
#define IOCON_PIO_FUNC1 0x01u         /*!<@brief Selects pin function 1 */
#define IOCON_PIO_INV_DI 0x00u        /*!<@brief Input function is not inverted */
#define IOCON_PIO_MODE_INACT 0x00u    /*!<@brief No addition pin function */
#define IOCON_PIO_MODE_PULLUP 0x20u   /*!<@brief Selects pull-up function */
#define IOCON_PIO_OPENDRAIN_DI 0x00u  /*!<@brief Open drain is disabled */
#define IOCON_PIO_SLEW_STANDARD 0x00u /*!<@brief Standard mode, output slew rate control is enabled */

/*! @name FC0_RXD_SDA_MOSI_DATA (number 45), J8[6]/J9[18]/U12[6]/FC0_I2C_SDA
  @{ */
/* @} */

/*! @name FC0_TXD_SCL_MISO_WS (number 52), J8[5]/J10[3]/U12[4]/FC0_I2C_SCL
  @{ */
/* @} */

/*! @name PIO1_23 (number 27), J9[5]/U12[11]/ACC_INT_EXP_P1_23
  @{ */
#define BOARD_INITACCELPINS_ACCL_INTR_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITACCELPINS_ACCL_INTR_PORT 1U   /*!<@brief PORT device name: 1U */
#define BOARD_INITACCELPINS_ACCL_INTR_PIN 23U   /*!<@brief 1U pin index: 23 */
                                                /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitACCELPins(void); /* Function assigned for the Cortex-M33 */

#define IOCON_PIO_DIGITAL_EN 0x0100u  /*!<@brief Enables digital function */
#define IOCON_PIO_FUNC1 0x01u         /*!<@brief Selects pin function 1 */
#define IOCON_PIO_INV_DI 0x00u        /*!<@brief Input function is not inverted */
#define IOCON_PIO_MODE_INACT 0x00u    /*!<@brief No addition pin function */
#define IOCON_PIO_OPENDRAIN_DI 0x00u  /*!<@brief Open drain is disabled */
#define IOCON_PIO_SLEW_STANDARD 0x00u /*!<@brief Standard mode, output slew rate control is enabled */

/*! @name CAN0_TD (number 41), J18[7]/JP26[2]/U24[13]/CAN__HSSPI_ISP_PIO1_2
  @{ */
/* @} */

/*! @name CAN0_RD (number 42), J18[5]/JP25[2]/U24[12]/CAN__HSSPI_ISP_PIO1_3
  @{ */
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitCANPins(void); /* Function assigned for the Cortex-M33 */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
